Revit 2026 API

# Transform1DMultiply Method

---

Multiplies this transformation by the specified transformation and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform1D Multiply(
	Transform1D right
)
```
```vb
Public Function Multiply (
	right As Transform1D
) As Transform1D
```
```cpp
public:
Transform1D^ Multiply(
	Transform1D^ right
)
```
```fsharp
member Multiply :
        right : Transform1D -> Transform1D
```

#### Parameters

right Transform1D
     The input transformation.

#### Return Value

Transform1D The transformation equal to the composition of the two transformations.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The combined transformation has the same effect as applying the input transformation first, and this transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).

#### Reference

Transform1D Class

Autodesk.Revit.DB Namespace